scripts/2_add_form_IG_em_atividades_PE.yaml
config:
  target: 'http://localhost:9995'
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 1
  processor: "../src/index.js"
  defaults:
    headers:
      Content-Type: application/json
  variables:
    cpf: "111.111.111-11"
    senha: "12345678"
    situacao_atividade_nova_seq: 1
    inspecao_geral_form_id: 1
    tpo_atividade_PE_id: 3
scenarios:
  - name: "adição de formulario ao tipo de atividade no qual serão inseridos registros"
    flow:
        # login/auth
        - get:
            url: "/api/auth/pesquisar-unidades-por-cpf"
            qs:
              cpf: "{{ cpf }}"
            afterResponse:
              - "showResponseStatus"
            capture:
              - json: "$[0].id"
                as: "unidade_id"
        - post:
            url: "/api/auth"
            afterResponse:
              - "showResponseStatus"
            json:
              cpf: "{{ cpf }}"
              password: "{{ senha }}"
              unidadeId: "{{ unidade_id }}"
            capture:
              - json: "$.token"
                as: "token"
              - json: "$.usuario.unidade.areaGestao.id"
                as: "area_gestao_id"
        # adiciona o formulário "Inspeção Geral" às atividdades do tipo "PE"
        - post:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/tipoatividade-formulario/bulk"
            qs:
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            afterResponse:
              - "showResponseStatus"
            json:
              [
                {
                  formularioId: "{{ inspecao_geral_form_id }}",
                  tipoAtividadeId: "{{ tpo_atividade_PE_id }}"
                }
              ]
            capture:
              - json: "$"
                as: "form_pe_body"
        # torna o formulário "Inspeção Geral" principal
        - put:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/tipoatividade-formulario/atualizar-formulario-principal"
            qs:
              tipoAtividadeId: "{{ tpo_atividade_PE_id }}"
              formularioId: "{{ inspecao_geral_form_id }}"
              principal: true
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            beforeRequest:
              - "setFormAsPrincipal"
            afterResponse:
              - "showResponseStatus"
        # remove o formulário "Inspeção Geral" das atividdades do tipo "PE"
        - delete:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/tipoatividade-formulario"
            qs:
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
              tipo_atividade_id: "{{ tpo_atividade_PE_id }}"
              formulario_id: "{{ inspecao_geral_form_id }}"
            afterResponse:
              - "showResponseStatus"