scripts/3_equipes.yaml
config:
  target: 'http://localhost:9995'
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 1
  processor: "../src/index.js"
  defaults:
    headers:
      Content-Type: application/json
  variables:
    cpf: "111.111.111-11"
    senha: "12345678"
scenarios:
  - name: "cadastro/remoção de equipes"
    flow:
        # login/auth
        - get:
            url: "/api/auth/pesquisar-unidades-por-cpf"
            qs:
              cpf: "{{ cpf }}"
            afterResponse:
              - "showResponseStatus"
            capture:
              - json: "$[0].id"
                as: "unidade_id"
              - json: "$[0]"
                as: "obj_unidade_atual"
        - post:
            url: "/api/auth"
            afterResponse:
              - "showResponseStatus"
            json:
              cpf: "{{ cpf }}"
              password: "{{ senha }}"
              unidadeId: "{{ unidade_id }}"
            capture:
              - json: "$.token"
                as: "token"
              - json: "$.usuario.unidade.areaGestao.id"
                as: "area_gestao_id"
        # cria uma equipe vazia
        - post:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/equipes"
            qs:
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            beforeRequest:
              - "createEquipeJsonBody"
            afterResponse:
              - "showResponseStatus"
            capture:
              - json: "$.id"
                as: "equipe_criada_id"
        # adiciona os usuarios [1, 2] na equipe previamente criada
        - post:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/equipe-vinculo/bulk"
            qs:
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            afterResponse:
              - "showResponseStatus"
            json:
              [
                {
                  agente: true,
                  equipeId: "{{ equipe_criada_id }}",
                  supervisor: false,
                  vinculoId: {pessoaId: 1, unidadeId: "{{ unidade_id }}"},
                  pessoaId: 1,
                  unidadeId: 1,
                },
                {
                  agente: false,
                  equipeId: "{{ equipe_criada_id }}",
                  supervisor: true,
                  vinculoId: {pessoaId: 2, unidadeId: "{{ unidade_id }}"},
                  pessoaId: 2,
                  unidadeId: "{{ unidade_id }}",
                }
              ]
        # deleta os usuarios [1, 2] que haviam sido vinculados anteriormente
        - delete:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/equipe-vinculo"
            qs:
              equipe_id: "{{ equipe_criada_id }}"
              pessoa_id: 1
              unidade_id: "{{ unidade_id }}"
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            afterResponse:
              - "showResponseStatus"
        - delete:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/equipe-vinculo"
            qs:
              equipe_id: "{{ equipe_criada_id }}"
              pessoa_id: 2
              unidade_id: "{{ unidade_id }}"
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            afterResponse:
              - "showResponseStatus"
        # deleta a equipe criada anteriormente
        - delete:
            headers:
              Authorization: "Bearer {{ token }}"
            url: "/api/v1/equipes/{{ equipe_criada_id }}"
            qs:
              unidade_atual_id: "{{ unidade_id }}"
              area_gestao_atual_id: "{{ area_gestao_id }}"
            afterResponse:
              - "showResponseStatus"